{
    "recipes": [
        {
            "id": "Brownie-1",
            "name": "Chocolate Raspberry Brownies",
            "time": "40 mins",
            "level": "Easy",
            "portion": "15 squares",
            "image": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
            "description": "Squidgy and super moreish, these gorgeous foolproof fruity chocolate bakes will be snapped up in seconds",
            "ingredients": [
                "200g dark chocolate, broken into chunks",
                "100g milk chocolate, broken into chunks",
                "250g pack salted butter",
                "400g soft light brown sugar",
                "4 large eggs",
                "140g plain flour",
                "50g cocoa powder",
                "200g raspberries"
            ],
            "steps": [
                "Heat oven to 180C/160C fan/gas 4.",
                "Line a 20 x 30cm baking tray tin with baking parchment.",
                "Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon.",
                "Remove from the heat.",
                "Stir the eggs, one by one, into the melted chocolate mixture.",
                "Sieve over the flour and cocoa, and stir in.",
                "Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries.",
                "Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more.",
                "Cool before slicing into squares. Store in an airtight container for up to 3 days."
            ],
            "category": "Dessert", 
            "rate": 5.0
        },
        {
            "id": "Salmon-1",
            "name": "Salmon Eggs Eggs Benedict",
            "time": "30 mins",
            "level": "Difficult",
            "portion": "4 serves",
            "image": "https://www.themealdb.com/images/media/meals/1550440197.jpg",
            "description": "Get your poaching technique honed and serve up this brunch classic – it's easily-doubled to feed a family or crowd",
            "ingredients": [
                "4 eggs",
                "2 tbsp white wine vinegar",
                "2 English muffins, halved",
                "a little butter, for spreading",
                "8 slices smoked salmon",
                "chopped chives, to serve",
                "2 tsp lemon juice",
                "2 tsp white wine vinegar",
                "3 egg yolks",
                "125g unsalted butter, diced"
            ],
            "steps": [
                "First make the hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy.",
                "Place the bowl over a pan of simmering water and whisk until mixture thickens.",
                "Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins.",
                "Season and keep warm.",
                "To poach the eggs, bring a large pan of water to the boil and add the vinegar.",
                "Lower the heat so that the water is simmering gently.",
                "Stir the water so you have a slight whirlpool, then slide in the eggs one by one.",
                "Cook each for about 4 mins, then remove with a slotted spoon.",
                "Lightly toast and butter the muffins, then put a couple of slices of salmon on each half.",
                "Top each with an egg, spoon over some hollandaise and garnish with chopped chives."
            ],
            "category": "Breakfast",
            "rate": 4.0
        },
        {
            "id": "Soup-1",
            "name": "French Onion Soup",
            "time": "60 mins",
            "level": "Easy",
            "portion": "4 serves",
            "image": "https://www.themealdb.com/images/media/meals/xvrrux1511783685.jpg",
            "description": "Our French onion soup is deliciously rich and easy to make at home. This savoury soup is perfect for using up a garden glut and great for dinner parties",
            "ingredients": [
                "50g butter",
                "1 tbsp olive oil",
                "1kg onions, halved and thinly sliced",
                "1 tsp sugar",
                "4 garlic cloves, thinly sliced",
                "2 tbsp plain flour",
                "250ml dry white wine",
                "1.3l hot strongly-flavoured beef stock",
                "4-8 slices baguette (depending on size)",
                "140g gruyère, finely grated"
            ],
            "steps": [
                "Melt the butter with the olive oil in a large heavy-based pan.",
                "Add the onions and fry with the lid on for 10 mins until soft.",
                "Sprinkle in the sugar and cook for 20 mins more, stirring frequently, until caramelised.",
                "Add the garlic cloves for the final few minutes of the onions’ cooking time, then sprinkle in the plain flour and stir well.",
                "Increase the heat and keep stirring as you gradually add the wine, followed by the beef stock.",
                "Cover and simmer for 15-20 mins.",
                "To serve, turn on the grill, and toast the bread.",
                "Ladle the soup into heatproof bowls.",
                "Put a slice or two of toast on top of the bowls of soup, and pile on the gruyère."
            ],
            "category": "Soup",
            "rate": 4.5
        },
        {
            "id": "Lasagna-1",
            "name": "Vegan Lasagna",
            "time": "120 mins",
            "level": "Easy",
            "portion": "6 serves",
            "image": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
            "description": "Feed your family this delicious plant-based lasagne with salad. Plus, use the meat-free filling to make vegan spaghetti bolognese and moussaka",
            "ingredients": [
                "30g bag dried porcini mushrooms",
                "6 tbsp olive oil",
                "1 onion, finely chopped",
                "2 carrots, finely chopped",
                "2 celery sticks, finely chopped",
                "4 garlic cloves, sliced",
                "few sprigs of thyme",
                "1 tsp tomato purée",
                "100ml vegan red wine (optional)",
                "250g dried green lentils",
                "2 x 400g cans whole plum tomatoes",
                "250g pack chestnut mushrooms, chopped",
                "250g pack portobello mushrooms, sliced",
                "1 tsp soy sauce",
                "1 tsp Marmite",
                "6 tbsp plain flour",
                "900ml soya milk",
                "1 whole nutmeg, for grating",
                "12 lasagne sheets"
            ],
            "steps": [
                "Pour 800ml boiling water over the dried porcini and leave for 10 mins until hydrated.",
                "Meanwhile pour 1½ tbsp oil into a large saucepan. Add the onion, carrot, celery and a pinch of salt.",
                "Cook gently, stirring for 10 mins until soft..",
                "Remove the porcini from the liquid, keeping the mushroomy stock and roughly chop. Set both aside.",
                "Add the garlic and thyme to the pan. Cook for 1 min, then stir in the tomato purée and cook for a minute more.",
                "Pour in the red wine, if using, cook until nearly reduced, then add the lentils, reserved mushroom stock and cans of tomatoes.",
                "Bring to the boil, then reduce the heat and leave to simmer with the lid on.",
                "Meanwhile, heat a large frying pan. Add 1½ tbsp oil, then tip all of the mushrooms into the pan, including the rehydrated ones.",
                "Fry until all the water has evaporated and the mushrooms are deep golden brown.",
                "Pour in the soy sauce. Give everything a good mix, then scrape the mushrooms into the lentil saucepan.",
                "Stir in the Marmite, then continue to cook the ragu, stirring occasionally, over a low to medium heat for 30-45 mins until the lentils are cooked and the sauce is thick and reduced, adding extra water if necessary.",
                "Remove the thyme sprigs and season to taste.",
                "Heat the oven to 180C/160C fan/gas 4.",
                "To make the white sauce, heat 3 tbsp olive oil in a pan, whisk in the flour and cook for a couple of minutes to get rid of the raw flour taste, then slowly whisk in the soya milk.",
                "Cook until you have a creamy sauce, about 10 mins. Season to taste, adding a good grating of nutmeg.",
                "Spread a third of the ragu on the bottom of your ovenproof dish, then top with six lasagne sheets, followed by another third of the vegan white sauce, then another third of the ragu.",
                "Top with the remaining lasagne sheets, then the remaining ragu and finally, spread over the rest of the white sauce.",
                "Sprinkle over the nutritional yeast, if using, and bake for 45 mins-1 hr until the pasta is cooked."
            ],
            "category": "Vegan",
            "rate": 4.0
        }
    ]
}
